       1:      1  1 CALL pred exception_value:main/2-0 (cc_multi) exception_value.m:12
mdb> echo on
Command echo enabled.
mdb> register --quiet
mdb> break p
 0: + stop  interface pred exception_value:p/1-0 (det)
mdb> break q
 1: + stop  interface pred exception_value:q/1-0 (det)
mdb> continue
       4:      4  4 CALL pred exception_value:p/1-0 (det) exception_value.m:30 (exception.m:NNNN)
mdb> finish
       7:      4  4 EXCP pred exception_value:p/1-0 (det)
mdb> print exception
	"p exception"
mdb> continue
exception(univ_cons("p exception"))
      18:     11  4 CALL pred exception_value:q/1-0 (det) exception_value.m:35 (exception.m:NNNN)
mdb> finish
      21:     11  4 EXCP pred exception_value:q/1-0 (det)
mdb> browse exception
browser> set depth 9
browser> set size 99
browser> ls
-
1-"q oops"
2-[|]
  1-1
  2-[|]
    1-2
    2-[|]
      1-3
      2-[]

browser> quit
mdb> continue
exception(univ_cons("q oops" - [1, 2, 3]))
